{
    "name": "Image pull policy on latest tag",
    "attributes": {
        "armoBuiltin": true,
        "controlTypeTags": [
            "devops"
        ]
    },
    "description": "While usage of the latest tag is not generally recommended, in some cases this is necessary. If it is, the ImagePullPolicy must be set to Always, otherwise Kubernetes may run an older image with the same name that happens to be present in the node cache. Note that using Always will not cause additional image downloads because Kubernetes will check the image hash of the local local against the registry and only pull the image if this hash has changed, which is exactly what users want when use the latest tag. This control will identify all pods with latest tag that have ImagePullSecret not set to Always.",
    "remediation": "Set ImagePullPolicy to Always in all pods found by this control.",
    "rulesNames": [
        "image-pull-policy-is-not-set-to-always"
    ],
    "long_description": "While usage of the latest tag is not generally recommended, in some cases this is necessary. If it is, the ImagePullPolicy must be set to Always, otherwise Kubernetes may run an older image with the same name that happens to be present in the node cache. Note that using Always will not cause additional image downloads because Kubernetes will check the image hash of the local local against the registry and only pull the image if this hash has changed, which is exactly what users want when use the latest tag. This control will identify all pods with latest tag that have ImagePullSecret not set to Always. Note as well that some vendors don't use the word latest in the tag. Some other word may also behave like the latest. For example, Redis uses redis:alpine to signify the latest. Therefore, this control treats any word that does not contain digits as the latest. If no tag is specified, the image is treated as latests too.",
    "test": "If  imagePullPolicy = always pass, else fail.",
    "controlID": "C-0075",
    "category": {
        "name" : "Workload"
   },
    "baseScore": 2.0,
    "scanningScope": {
        "matches": [
            "cluster",
            "file"
        ]
    }
}