{
  "controlID": "C-0181",
  "name": "Ensure that the --tls-cert-file and --tls-private-key-file arguments are set as appropriate",
  "description": "Setup TLS connection on the Kubelets.",
  "long_description": "The connections from the apiserver to the kubelet are used for fetching logs for pods, attaching (through kubectl) to running pods, and using the kubelet’s port-forwarding functionality. These connections terminate at the kubelet’s HTTPS endpoint. By default, the apiserver does not verify the kubelet’s serving certificate, which makes the connection subject to man-in-the-middle attacks, and unsafe to run over untrusted and/or public networks.",
  "remediation": "If using a Kubelet config file, edit the file to set tlsCertFile to the location of the certificate file to use to identify this Kubelet, and tlsPrivateKeyFile to the location of the corresponding private key file. If using command line arguments, edit the kubelet service file /etc/kubernetes/kubelet.conf on each worker node and set the below parameters in KUBELET\\_CERTIFICATE\\_ARGS variable. --tls-cert-file=<path/to/tls-certificate-file> --tls-private-key-file=<path/to/tls-key-file>Based on your system, restart the kubelet service. For example: ```systemctl daemon-reloadsystemctl restart kubelet.service```",
  "manual_test": "Run the following command on each node: ```ps -ef | grep kubelet``` Verify that the --tls-cert-file and --tls-private-key-file arguments exist and they are set as appropriate. If these arguments are not present, check that there is a Kubelet config specified by --config and that it contains appropriate settings for tlsCertFile and tlsPrivateKeyFile.",
  "references": [
    "https://workbench.cisecurity.org/sections/1126668/recommendations/1838657"
  ],
  "attributes": {
    "armoBuiltin": true
  },
  "rulesNames": [
    "validate-kubelet-tls-configuration-updated"
  ],
  "baseScore": 7,
  "impact_statement": "",
  "default_value": "",
  "scanningScope": {
    "matches": [
      [
        "cluster",
        "cloud"
      ]
    ]
  }
}
