{
    "controlID": "C-0159",
    "name": "Ensure that a unique Certificate Authority is used for etcd",
    "description": "Use a different certificate authority for etcd from the one used for Kubernetes.",
    "long_description": "etcd is a highly available key-value store used by Kubernetes deployments for persistent storage of all of its REST API objects. Its access should be restricted to specifically designated clients and peers only.\n\n Authentication to etcd is based on whether the certificate presented was issued by a trusted certificate authority. There is no checking of certificate attributes such as common name or subject alternative name. As such, if any attackers were able to gain access to any certificate issued by the trusted certificate authority, they would be able to gain full access to the etcd database.",
    "remediation": "Follow the etcd documentation and create a dedicated certificate authority setup for the etcd service.\n\n Then, edit the etcd pod specification file `/etc/kubernetes/manifests/etcd.yaml` on the master node and set the below parameter.\n\n \n```\n--trusted-ca-file=</path/to/ca-file>\n\n```",
    "manual_test": "Review the CA used by the etcd environment and ensure that it does not match the CA certificate file used for the management of the overall Kubernetes cluster.\n\n Run the following command on the master node:\n\n \n```\nps -ef | grep etcd\n\n```\n Note the file referenced by the `--trusted-ca-file` argument.\n\n Run the following command on the master node:\n\n \n```\nps -ef | grep apiserver\n\n```\n Verify that the file referenced by the `--client-ca-file` for apiserver is different from the `--trusted-ca-file` used by etcd.",
    "references": [
        "https://workbench.cisecurity.org/sections/1126654/recommendations/1838578"
    ],
    "attributes": {
    },
    "rulesNames": [
        "etcd-unique-ca"
    ],
    "baseScore": 8,
    "impact_statement": "Additional management of the certificates and keys for the dedicated certificate authority will be required.",
    "default_value": "By default, no etcd certificate is created and used.",
    "category": {
        "name" : "Control plane"
   },
    "scanningScope": {
        "matches": [
            "cluster"
        ]
    }
}