{
    "controlID": "C-0115",
    "name": "Ensure that the API Server --DenyServiceExternalIPs is not set",
    "description": "This admission controller rejects all net-new usage of the Service field externalIPs.",
    "long_description": "This admission controller rejects all net-new usage of the Service field externalIPs. This feature is very powerful (allows network traffic interception) and not well controlled by policy. When enabled, users of the cluster may not create new Services which use externalIPs and may not add new values to externalIPs on existing Service objects. Existing uses of externalIPs are not affected, and users may remove values from externalIPs on existing Service objects.\n\n Most users do not need this feature at all, and cluster admins should consider disabling it. Clusters that do need to use this feature should consider using some custom policy to manage usage of it.",
    "remediation": "Edit the API server pod specification file `/etc/kubernetes/manifests/kube-apiserver.yaml` on the master node and remove the `--DenyServiceExternalIPs'parameter\n\n or\n\n The Kubernetes API server flag disable-admission-plugins takes a comma-delimited list of admission control plugins to be disabled, even if they are in the list of plugins enabled by default.\n\n `kube-apiserver --disable-admission-plugins=DenyServiceExternalIPs,AlwaysDeny ...`",
    "manual_test": "Run the following command on the Control Plane node:\n\n \n```\nps -ef | grep kube-apiserver\n\n```\n Verify that the `--DenyServiceExternalIPs argument does not exist.",
    "references": [
        "https://workbench.cisecurity.org/sections/1126663/recommendations/1838614"
    ],
    "attributes": {
    },
    "rulesNames": [
        "ensure-that-the-api-server-DenyServiceExternalIPs-is-not-set"
    ],
    "baseScore": 4,
    "impact_statement": "When enabled, users of the cluster may not create new Services which use externalIPs and may not add new values to externalIPs on existing Service objects.",
    "default_value": "By default, `--token-auth-file` argument is not set.",
    "category": {
        "name" : "Control plane"
   },
    "scanningScope": {
        "matches": [
            "cluster"
        ]
    }
}