{
    "name": "Minimize access to the proxy sub-resource of nodes",
    "controlID": "C-0279",
    "description": "Users with access to the Proxy sub-resource of Node objects automatically have permissions to use the Kubelet API, which may allow for privilege escalation or bypass cluster security controls such as audit logs.",
    "long_description": "Users with access to the Proxy sub-resource of Node objects automatically have permissions to use the Kubelet API, which may allow for privilege escalation or bypass cluster security controls such as audit logs. The Kubelet provides an API which includes rights to execute commands in any container running on the node. Access to this API is covered by permissions to the main Kubernetes API via the node object. The proxy sub-resource specifically allows wide ranging access to the Kubelet API. Direct access to the Kubelet API bypasses controls like audit logging (there is no audit log of Kubelet API access) and admission control.",
    "remediation": "Where possible, remove access to the proxy sub-resource of node objects.",
    "manual_test": "Review the users who have access to the proxy sub-resource of node objects in the Kubernetes API.",
    "test": "Check which subjects have RBAC permissions to access the proxy sub-resource of node objects.",
    "references": [
        "https://workbench.cisecurity.org/sections/2633388/recommendations/4261961"
    ],
    "attributes": {
    },
    "rulesNames": [
        "rule-can-access-proxy-subresource"
    ],
    "baseScore": 5,
    "impact_statement": "Users with access to the proxy sub-resource of node objects automatically have permissions to use the Kubelet API, which may allow for privilege escalation or bypass cluster security controls such as audit logs.",
    "category": {
        "name" : "Access control"
   },
    "default_value": "By default in a kubeadm cluster the following list of principals have `create` privileges on `node/proxy` objects ```CLUSTERROLEBINDING                                    SUBJECT                             TYPE            SA-NAMESPACEcluster-admin                                         system:masters                      Group           system:controller:clusterrole-aggregation-controller  clusterrole-aggregation-controller  ServiceAccount  kube-systemsystem:controller:daemon-set-controller               daemon-set-controller               ServiceAccount  kube-systemsystem:controller:job-controller                      job-controller                      ServiceAccount  kube-systemsystem:controller:persistent-volume-binder            persistent-volume-binder            ServiceAccount  kube-systemsystem:controller:replicaset-controller               replicaset-controller               ServiceAccount  kube-systemsystem:controller:replication-controller              replication-controller              ServiceAccount  kube-systemsystem:controller:statefulset-controller              statefulset-controller              ServiceAccount  kube-system```",
    "scanningScope": {
        "matches": [
            "cluster",
            "file"
        ]
    }
}