{
    "controlID": "CIS-3.1.3",
    "name": "Ensure that the kubelet configuration file has permissions set to 644 or more restrictive",
    "description": "Ensure that if the kubelet refers to a configuration file with the `--config` argument, that file has permissions of 644 or more restrictive.",
    "long_description": "The kubelet reads various parameters, including security settings, from a config file specified by the `--config` argument. If this file is specified you should restrict its file permissions to maintain the integrity of the file. The file should be writable by only the administrators on the system.",
    "remediation": "Run the following command (using the config file location identified in the Audit step)\n\n \n```\nchmod 644 /etc/kubernetes/kubelet/kubelet-config.json\n\n```",
    "manual_test": "First, SSH to the relevant worker node:\n\n To check to see if the Kubelet Service is running:\n\n \n```\nsudo systemctl status kubelet\n\n```\n The output should return `Active: active (running) since..`\n\n Run the following command on each node to find the appropriate Kubelet config file:\n\n \n```\nps -ef | grep kubelet\n\n```\n The output of the above command should return something similar to `--config /etc/kubernetes/kubelet/kubelet-config.json` which is the location of the Kubelet config file.\n\n Run the following command:\n\n \n```\nstat -c %a /etc/kubernetes/kubelet/kubelet-config.json\n\n```\n The output of the above command is the Kubelet config file's permissions. Verify that the permissions are `644` or more restrictive.",
    "references": [
        "https://kubernetes.io/docs/tasks/administer-cluster/kubelet-config-file/"
    ],
    "attributes": {
        "armoBuiltin": true
    },
    "rulesNames": ["ensure-that-the-kubelet-configuration-file-has-permissions-set-to-644-or-more-restrictive"],
    "baseScore": 0,
    "impact_statement": "None.",
    "default_value": "See the AWS EKS documentation for the default value.",
    "control-CIS-ID": "CIS-3.1.3"
} 